/*
 * DAC_AD5432.c
 *
 * Created: 03.07.2014 12:54:31
 *  Author: 554-pea
 */ 

#include <avr/io.h>
#include "DAC_AD5432.h"
#include "BGO_Tiny2313.h"

//******************************************************************************************************************
//Инициализация Цапа
void DacInit(void)
{
	
	SendDataToDac(DAISY_CHAIN_DISABLE, 0x0000);		//отключение режима последовательного включения ЦАПов, данные 0
	SendDataToDac(DAC_OUT_TO_ZERO_SCALE, 0x0000);			//установить выход ЦАПа в 0
	//UpDown();										//Тест ЦАПа прогоном диапазона данных снизу вверх и сверху вниз
		
}

//******************************************************************************************************************
//Установить ЦАП на середину диапазона
void SetToMidScale(void)
{
	SendDataToDac(DAC_OUT_TO_MIDSCALE, 0x0000);
}

//******************************************************************************************************************
//Установить ЦАП в 0
void SetToZeroScale(void)
{
	SendDataToDac(DAC_OUT_TO_ZERO_SCALE, 0x0000);
}

//******************************************************************************************************************
//Установить ЦАП на максимум
void SetToMaxScale(void)
{
	SendDataToDac(LOAD_AND_UPDATE, 0x0400);
}

//******************************************************************************************************************
//Тест ЦАПа прогоном диапазона данных снизу вверх и сверху вниз
void UpDown(void)
{
	
	uint16_t i;
	
	while(TouchButton == 1)
	//while(1)
	
		{
	
		for (i=0;i<=1023;i++)
			{
				SendDataToDac(LOAD_AND_UPDATE, i);
				//ввести задержку		
			}
	
		for (i=1022;i>0;i--)
			{
				SendDataToDac(LOAD_AND_UPDATE, i);
				//ввести задержку
			}
		SendDataToDac(LOAD_AND_UPDATE, 0);
			
			if (TouchButton == 1)
			{
				TouchButton = 0;
				
			}
			
		}
		
	
	
}

//******************************************************************************************************************
//Передача команды и данных в ЦАП
void SendDataToDac(uint8_t Command, uint16_t Data)
{
	
	uint8_t				Temp_0;				//временная переменная для команд
	uint16_t			Temp_1;					//временная переменная для данных
	volatile uint8_t	i=0;				//счётчик цикла
	
	Temp_0 = (Command & (~0xF7));			//скопировать во временный ригистр маскированную команду
	Temp_1 = (Data & (~0x01FF));			//скопировать во временный ригистр маскированные данные
	
	
	PORTB &= ~(1<<DAC_SYNC);					//активировать ЦАП, активный уровень 0
	
	for (i=0;i<=3;i++)						//цикл передачи 4х бит команды для ЦАПа
		{
			
			if (Temp_0 == 0b00001000)			//если равно
				{
				
					PORTB |= (1<<DAC_DATA);	//выставить на выводе данных 1	
				
				} 
			else                                 //иначе
				{
					
					PORTB &= ~(1<<DAC_DATA);//выставить на выводе данных 0
					
				}
				
				PORTB |= (1<<DAC_CLK);			//тактовый сигнал для сдвига данных в сдвиговый регистр ЦАПа
				PORTB &= ~(1<<DAC_CLK);			//установка 1 и затем 0
				
				Command = Command<<1;					//сдвиг байта команды на 1 бит
				Temp_0 = (Command & (~0xF7));	//копирование маскированного значения команды во временный регистр
		
		}
	
		
		
	for (i=0;i<=9;i++)						//цикл передачи 10ти бит данных для ЦАПа
		{
			
			if (Temp_1 == 0x0200)				//если равно
				{
				
					PORTB |= (1<<DAC_DATA);//выставить на выводе данных 1
				
				} 
			else                                 //иначе
				{
					
					PORTB &= ~(1<<DAC_DATA);//выставить на выводе данных 0
					
				}
				
					PORTB |= (1<<DAC_CLK);		//тактовый сигнал для сдвига данных в сдвиговый регистр ЦАПа
					PORTB &= ~(1<<DAC_CLK);		//установка 1 и затем 0
					
					Data = Data<<1;					//сдвиг байта данных на 1 бит
					Temp_1 = (Data & (~0xFDFF));//копирование маскированного значения данных во временный регистр
			
		}
	//передача 2х нулевых бит совместимости (являются значащими при использовании ЦАПа 12 бит)
	PORTB &= ~(1<<DAC_DATA);				//выставить на выводе данных 0
	PORTB |= (1<<DAC_CLK);						//тактовый сигнал для сдвига данных в сдвиговый регистр ЦАПа
	PORTB &= ~(1<<DAC_CLK);					//установка 1 и затем 0
	PORTB |= (1<<DAC_CLK);						//тактовый сигнал для сдвига данных в сдвиговый регистр ЦАПа
	PORTB &= ~(1<<DAC_CLK);					//установка 1 и затем 0
	
	PORTB |= (1<<DAC_SYNC);						//деактивировать ЦАП,  уровень 1
	
	//Counter++;
	
}