/* Created: 25.11.2014 10:22:41
 * DS1307.c
 *
 * 
 *
 */ 

#include <avr/io.h>
#include <util/delay.h>
#include "I2C.h"
#include "DS1307.h"

//uint8_t DirectionData;
//uint8_t OffsetAddrRW;
//uint8_t NumberByteRW;
//uint8_t CurrentAddressRW;
//uint8_t RWDeviceFlag;
//uint8_t *RWBytePointer;

//*********************************************************************************************
//Настройка RTC
void DS1307_Init(void)
{											   
	RWBytePointer = (uint8_t *)&DS1307_RTC_Control; //Загрузить начальный адрес значения регистра настройки RTC
	NumberByteRW = 1;									//Отправить 1 байт
	OffsetAddrRW = 0;								// Смещение байта в структуре нулевое
	DirectionDataWrite;									// Запись данных
	RWDeviceFlag = 0;
	CurrentAddressRW = DS1307_CONTROL_ADDR_REG;		// Установить адрес регистра управления ведомого устройства
	SEND_START;
	//Перед посылкой данных сформировать старт передачи, отправить адрес ведомого устройства и адрес регистра, по адресу которого будет осуществляться запись
	// 
}



//*********************************************************************************************
//Чтение из памяти ведомого устройства
void ReadDS1307Byte(uint8_t Byte)
{
	
}

//*********************************************************************************************
//Запись в память ведомого
void WriteDS1307Byte(uint8_t Byte)
{
	
}

//*********************************************************************************************
//Адресация ведомого устройства с битом признака чтения или записи 
void AddressingRTC(uint8_t SlaveAddr, uint8_t Addr, uint8_t ReadWriteBit)
{
	
	
	
}

//*********************************************************************************************
//Тест I2C шины (проверка уровней напряжения линии данных и тактовых сигналов)
void BusTest(void)
{
	if (!(CLK_PIN & DATA_PIN))
		{
			_delay_ms(1000);
			if (!(CLK_PIN & DATA_PIN))
				{
					//Звуковой сигнал неисправности шины I2C
						//перезагрузка или вывод служебной инфы на дисплей и продолжение работы с отключённым устройством
				
				}
			
		}
}



