/*
 * WaterControl.h
 *
 * Created: 17.11.2014 22:40:13
 *
 */ 


#ifndef WATERCONTROL_H_
#define WATERCONTROL_H_

//************************************************************************************************************************************
//Управление внешними устройствами

#define HeatingElementEnable    PORTD |= (1<<PORTD0)                    //Включить нагревательный элемент
#define HeatingElementDisable   PORTD &= (~(1<<PORTD0))                 //Выключить нагревательный элемент
#define PumpEnable              PORTD |= (1<<PORTD1)                    //Включить насос
#define PumpDisable             PORTD &= (~(1<<PORTD1))                 //Выключить насос

//************************************************************************************************************************************
//Индикация работы внешних устройств

#define LedHeatingEnable		PORTD |= (1<<PORTD2)					//Включить индикацию включения нагрева
#define LedHeatingDisable		PORTD &= (~(1<<PORTD2))					//Включить индикацию выключения нагрева
#define LedPumpEnable			PORTD |= (1<<PORTD3)					//Включить индикацию включения насоса
#define LedPumpDisable			PORTD &= (~(1<<PORTD3))					//Включить индикацию выключения насоса

//************************************************************************************************************************************
//Индикация режимов работы

#define LockRefillWater			PORTD |= (1<<PORTD4)					//Блокирование повторного заполнения бака с горячей водой включено
#define UnLockRefillWater		PORTD &= (~(1<<PORTD4))					//Блокирование повторного заполнения бака с горячей водой выключено


#endif /* WATERCONTROL_H_ */