/*
 * DS1821.c
 *
 *
 *
 */ 
#include <avr/io.h>
#include <util/delay.h>
#include "DS1821.h"

//******************************************************************************************************************
//Получение температуры с датчика
int8_t ReadTemperatureFromDS1821(void)
{
	int8_t Temperature = 0;
	
	SendCommandDS1821(START_CONVERT_T);
	_delay_ms(1000);
	SendCommandDS1821(READ_TEMPERATURE);	//отправка команды чтения температуры
	Temperature = ReadByteFrom1Wire();			//чтение температуры 
	
	return(Temperature);
		
}

//******************************************************************************************************************
//Получение информации о состоянии датчика температуры
uint8_t ReadStatusFromDS1821(void)
{
	uint8_t ReadStatus;
	
	SendCommandDS1821(READ_STATUS);		//отправка команды чтения статуса
	ReadStatus = ReadByteFrom1Wire();		//получение байта состояния

	return(ReadStatus);					//
}

//******************************************************************************************************************
//Запустить преобразование температуры температуры
void StartConvertTemperatureDS1821(void)
{	
	//Reset1WireLine();
	SendCommandDS1821(START_CONVERT_T);
}

//******************************************************************************************************************
//Остановить преобразование температуры температуры
void StopConvertTemperatureDS1821(void)
{
	//Reset1WireLine();
	SendCommandDS1821(STOP_CONVERT_T);	
}

//******************************************************************************************************************
//Начальная настройка датчика температуры
void SetConfigRegisterDS1821(void)
{
	volatile uint8_t ConfigRegister;
	
	//ConfigRegister = 0x18;
	
	ConfigRegister = ReadStatusFromDS1821();
	//ConfigRegister &= ~((1<<THF)|(1<<TLF));
	ConfigRegister |= (1<<ONESHOT);
	WriteStatusToDS1821(ConfigRegister);
	
	
}

//******************************************************************************************************************
//Отправка конфигурации датчику температуры
void WriteStatusToDS1821(uint8_t WriteStatus)
{	
	SendCommandDS1821(WRITE_STATUS);	//отпрвка команды запись настроек термодатчика
	WriteByteToDS1821(WriteStatus);			// запись настроек термодатчика
		
}



//******************************************************************************************************************
//Передача команды в 1-Wire устройство
void SendCommandDS1821(uint8_t Command)
{
	volatile uint8_t i,SendBit;
		
	SendBit = (~(0xFE) & Command);				//выделение младшего бита		
	Reset1WireLine();								//Сброс устройств на линии и приём сигнала готовности
	for (i=0; i<8; i++)							//цикл передачи 8-ми бит
		{
			
			if (SendBit==1)
				{
					WriteBit1To1Wire();			//запись лог 1
				}
			else
				{
					WriteBit0To1Wire();		//запись лог 0
				}
			Command=Command>>1;						//обновление младшего бита
			SendBit = (~(0xFE) & Command);		//выделение младшего бита
			Delay_nop();							//пауза после тайм-слота передачи одного бита (необходимая пауза между тайм-слотами минимум 1мкс)
			
		}
			
}



//******************************************************************************************************************
//Передача байта в 1-Wire устройство
void WriteByteToDS1821(uint8_t Byte)
{
	volatile uint8_t i, SendBit;
	
	SendBit = (~(0xFE) & Byte);					//выделение младшего бита	
	for (i=0; i<8; i++)						//цикл передачи 8-ми бит
	{
			
		if (SendBit==1)
			{
				WriteBit1To1Wire();				//запись лог 1
			}
		else
			{
				WriteBit0To1Wire();			//запись лог 0
			}
		Byte=Byte>>1;							//обновление младшего бита
		SendBit = (~(0xFE) & Byte);			//выделение младшего бита
		Delay_nop();							//пауза после тайм-слота передачи одного бита (необходимая пауза между тайм-слотами минимум 1мкс)
			
	}
	
}

//******************************************************************************************************************
//Считывание байта из 1-Wire устройства
uint8_t ReadByteFrom1Wire(void)
{
	uint8_t Temp_0;
	volatile uint8_t i, Byte;
	
	Byte = 0;								//обнуление переменной, принимающей байт с шины 1-Wire
	
	for (i=0; i<8; i++)							//цикл счёта приятых бит (всего 8)
		{
			Byte = Byte>>1;					//сдвиг вправо на 1 бит, байт принимается младшим битом вперёд, 1 сдвиг лишний в начале цикла
			Temp_0 = ReadBitFrom1Wire();		//считать бит с шины 1-Wire		
			if (Temp_0 == 1)				//если бит "1"
				{
					Byte |=0x80;				//записать на место старшего бита 1
				} 
			else  
				{
					Byte |=0x00;			//записать на место старшего бита 0 (эта часть условия может быть удалена)
				}
			Delay_nop();						//пауза после тайм-слота передачи одного бита (необходимая пауза между тайм-слотами минимум 1мкс)
			asm("nop");
		}	
		
	return(Byte);							//передать значение полученного байта
	
}



//******************************************************************************************************************
//Сброс шины 1-Wire и приём состояния готовности устройств
uint8_t Reset1WireLine(void)
{
	volatile uint8_t Error;
	
	asm("cli");										//Глобальное запрещение прерываний
			
	DS1821_DIRECT_PORT |= (1<<DS1821_DIRECT_PIN);		//	
	DS1821_DATA_PORT |= (0<<DS1821_DATA_PIN_OUT);		//Подтяжка линии к 0
	_delay_us(480);//480
	DS1821_DIRECT_PORT &= ~(1<<DS1821_DIRECT_PIN);	//Отпустить линию
	_delay_us(70);										//Ожидание от 60 до 240мкс 70, ответ 120мкс
	Error = ((DS1821_DATA_PIN_IN & (~(0xEF)))>>4);	//Выделить 4й бит и сдвинуть на позицию нулевого бита	
	_delay_us(510);										//&&&
	asm("sei");										//Глобальное разрешение прерываний
	return(Error);										//Передача кода ошибки (состояние линии в момент ожидания отклика от устройства)
}

//******************************************************************************************************************
//Запись нуля в шину 1-Wire 
void WriteBit0To1Wire(void)
{
	asm("cli");//Глобальное запрещение прерываний
	
	
	DS1821_DIRECT_PORT |= (1<<DS1821_DIRECT_PIN);					//
	DS1821_DATA_PORT |= (0<<DS1821_DATA_PIN_OUT);						//Подтяжка линии к 0
	_delay_us(60);	
	DS1821_DIRECT_PORT &= ~(1<<DS1821_DIRECT_PIN);					//Отпустить линию
	_delay_us(10);														//время, необходимое для восстановления линии в исходное состояние лог. 1
		
	asm("sei");//Глобальное разрешение прерываний
}

//******************************************************************************************************************
//Запись единицы в шину 1-Wire
void WriteBit1To1Wire(void)
{
	asm("cli");//Глобальное запрещение прерываний
	
	
	DS1821_DIRECT_PORT |= (1<<DS1821_DIRECT_PIN);					//
	DS1821_DATA_PORT |= (0<<DS1821_DATA_PIN_OUT);						//Подтяжка линии к 0
	_delay_us(5);	
	DS1821_DIRECT_PORT &= ~(1<<DS1821_DIRECT_PIN);					//Отпустить линию
	_delay_us(64);
	
	asm("sei");//Глобальное разрешение прерываний
}

//******************************************************************************************************************  
//Чтение бита с шины 1-Wire
uint8_t ReadBitFrom1Wire(void)
{
	volatile uint8_t ReadBit;
	
	asm("cli");//Глобальное запрещение прерываний
	
	DS1821_DATA_PORT |= (0<<DS1821_DATA_PIN_OUT);		//Подтяжка линии к 0
	DS1821_DIRECT_PORT |= (1<<DS1821_DIRECT_PIN);	//
	_delay_us(5);//пауза 6 мкс
	DS1821_DIRECT_PORT &= ~(1<<DS1821_DIRECT_PIN);		//Отпустить линию
	_delay_us(9);//пауза 9 мкс
	ReadBit = ((DS1821_DATA_PIN_IN & (~(0xEF)))>>4);//Выделить 4й бит и сдвинуть на позицию нулевого бита
	//ReadBit = DS1821_DATA_PIN_IN & (~(0xEF));
	//if (ReadBit == 0)
		//{
			//ReadBit = 0;
			////return(0);
		//} 
	//else
		//{
			//ReadBit = 1;
			////return(1);
		//}
	_delay_us(55);
	
	asm("sei");//Глобальное разрешение прерываний
	return(ReadBit);
}

//******************************************************************************************************************
//Задержка 2мкс (частота МК 4МГц)
void Delay_nop(void)
{
	asm("nop");asm("nop");asm("nop");asm("nop");
	asm("nop");asm("nop");asm("nop");asm("nop");
	//asm("nop");asm("nop");asm("nop");asm("nop");
	//asm("nop");asm("nop");asm("nop");asm("nop");
}